/**
 * Created by Administrator on 2017-9-5.
 */
import {Injectable} from '@angular/core';
import {Http} from '@angular/http';
import 'rxjs/add/operator/map';

/*
 Generated class for the EmojiProvider provider.

 See https://angular.io/docs/ts/latest/guide/dependency-injection.html
 for more info on providers and Angular 2 DI.
 */
@Injectable()
export class EmojiProvider {

  constructor(public http: Http) {
    console.log('Hello EmojiProvider Provider');
  }

  getEmojis() {
    const EMOJIS = "😊 😃 😏 😍 😘 😚 😳 😌 😆 😁 😉 😜 😝 😀 😙 😛 😴 😟 😦 😧 😮 😬 😕 😯 😑 😒 😅 " +
      " 😩 😔 😞 😖 😨 😰 😣 😢 😭 😂 😲 😱 😫 😠 😡 😤 😪 😋 😷 😎 😵 👿 😈 😐 😶 😇 👽 👦 👧 " +
      " 👩 👨 👶 👵 👴 👱 👲 👳 👷 👮 👼 👸 😺 😸 😻 😽 😼 🙀 😿 😹 😾 👹 👺 🙈 🙉 🙊 💂 💀" +
      " 💛 💙 💜 ❤️ 💚 💔 💓 💗 💕 💞 💘 💖👍 👎 👌 👊 ✊ ✌️ 👋 ✋ 👐 ☝️ 👇 👈 👉 🙌 🙏 👆 👏 💪 🤘 🖕" +
      " ‍☕ 🍵 🍶 🍼 🍺 🍻 🍸 🍹 🍷 🍴 🍕 🍔 🍟 🍗 🍖 🍝 🍛 🍤 🍱 🍣 🍥 🍙 🍘 🍚 🍜 🍲 🍢 🍡 🍞 🍩" +
      " 🍮 🍦 🍨 🍧 🎂 🍰 🍪 🍫 🍬 🍭 🍯 🍎 🍏 🍊 🍋 🍒 🍇 🍉 🍓 🍑 🍈 🍌 🍐 🍍 🍠 🍆 🍅 🌽" +
      "🚢 🚤 ⛵ ⛵ 🚣 ⚓ 🚀 ✈ 🚁 🚂 🚊 🚞 🚲 🚡 🚟 🚠 🚜 🚙 🚘 🚗 🚗 🚕 🚖 🚛 🚌 🚍 🚨 🚓 🚔 🚒 🚑 🚐 🚚 🚋 🚉 🚆 🚅 🚄 🚈 🚝 🚃 🚎" +
      " ♈ ♉ ♊ ♋ ♌️♍️♎️♏️♐ ♑ ♒ ♓ ⛎ 🏈 🏀 ⚽ ⚾ 🎾 🎱 🏉 🎳 📄 📃 📑 📊 📈 📉 📜 " +
      " 🎨 🎤 🎧 🎺 🎷 🎸 👞 👡 👠 💄 👢 👕 👕 👔 👚 👗 🎽 👖 👘 👙 🎀 🎩 👑 👒 👞 🌂 💼 👜 " +
      " 🎍 💝 🎎 🎒 🎓 🎏 🎆 🎇 🎐 🎑 🎃 👻 🎅 🎄 🎁 🔔 🔕 🎋 🎉 🎊 🎈 🔮 💿 📀 💾 📷 📹 🎥 💻 📺 📱 ☎️";

    let EmojiArr = EMOJIS.split(' ');
    let groupNum = Math.ceil(EmojiArr.length / (24));
    let items = [];

    for (let i = 0; i < groupNum; i++) {
      items.push(EmojiArr.slice(i * 24, (i + 1) * 24));
    }

    return items
  }

}
